benchmark/wrk2/bitmap-t1-c1-R2000.txt
Running 30s test @ http://127.0.0.1:8091/v1/search/bitmap/prices
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.009ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.97ms  390.97us   3.31ms   66.13%
    Req/Sec     2.11k   147.51     2.60k    71.03%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.97ms
 75.000%    1.25ms
 90.000%    1.42ms
 99.000%    2.01ms
 99.900%    2.23ms
 99.990%    2.97ms
 99.999%    3.31ms
100.000%    3.31ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.047     0.000000            1         1.00
       0.450     0.100000         4006         1.11
       0.586     0.200000         8028         1.25
       0.719     0.300000        12004         1.43
       0.843     0.400000        16003         1.67
       0.966     0.500000        20027         2.00
       1.027     0.550000        22015         2.22
       1.084     0.600000        24017         2.50
       1.140     0.650000        26015         2.86
       1.194     0.700000        28005         3.33
       1.247     0.750000        30026         4.00
       1.274     0.775000        31023         4.44
       1.299     0.800000        31998         5.00
       1.327     0.825000        33008         5.71
       1.356     0.850000        34022         6.67
       1.386     0.875000        34998         8.00
       1.403     0.887500        35496         8.89
       1.423     0.900000        35989        10.00
       1.447     0.912500        36489        11.43
       1.477     0.925000        36990        13.33
       1.516     0.937500        37492        16.00
       1.542     0.943750        37739        17.78
       1.585     0.950000        37991        20.00
       1.645     0.956250        38238        22.86
       1.703     0.962500        38488        26.67
       1.770     0.968750        38738        32.00
       1.802     0.971875        38863        35.56
       1.831     0.975000        38988        40.00
       1.864     0.978125        39112        45.71
       1.895     0.981250        39239        53.33
       1.928     0.984375        39362        64.00
       1.950     0.985938        39424        71.11
       1.971     0.987500        39488        80.00
       1.992     0.989062        39552        91.43
       2.013     0.990625        39613       106.67
       2.034     0.992188        39674       128.00
       2.047     0.992969        39706       142.22
       2.061     0.993750        39741       160.00
       2.075     0.994531        39770       182.86
       2.087     0.995313        39800       213.33
       2.113     0.996094        39832       256.00
       2.123     0.996484        39847       284.44
       2.131     0.996875        39864       320.00
       2.139     0.997266        39879       365.71
       2.153     0.997656        39893       426.67
       2.171     0.998047        39908       512.00
       2.179     0.998242        39918       568.89
       2.193     0.998437        39927       640.00
       2.199     0.998633        39932       731.43
       2.215     0.998828        39940       853.33
       2.231     0.999023        39947      1024.00
       2.237     0.999121        39951      1137.78
       2.255     0.999219        39955      1280.00
       2.277     0.999316        39959      1462.86
       2.345     0.999414        39963      1706.67
       2.423     0.999512        39967      2048.00
       2.487     0.999561        39969      2275.56
       2.577     0.999609        39971      2560.00
       2.605     0.999658        39973      2925.71
       2.675     0.999707        39975      3413.33
       2.723     0.999756        39977      4096.00
       2.781     0.999780        39978      4551.11
       2.787     0.999805        39979      5120.00
       2.905     0.999829        39980      5851.43
       2.969     0.999854        39981      6826.67
       2.973     0.999878        39982      8192.00
       2.973     0.999890        39982      9102.22
       3.153     0.999902        39983     10240.00
       3.153     0.999915        39983     11702.86
       3.219     0.999927        39984     13653.33
       3.219     0.999939        39984     16384.00
       3.219     0.999945        39984     18204.44
       3.241     0.999951        39985     20480.00
       3.241     0.999957        39985     23405.71
       3.241     0.999963        39985     27306.67
       3.241     0.999969        39985     32768.00
       3.241     0.999973        39985     36408.89
       3.307     0.999976        39986     40960.00
       3.307     1.000000        39986          inf
#[Mean    =        0.966, StdDeviation   =        0.391]
#[Max     =        3.306, Total count    =        39986]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59997 requests in 30.00s, 11.67MB read
Requests/sec:   1999.92
Transfer/sec:    398.42KB