benchmark/wrk2/bitmap-t2-c20-R2000.txt
Running 30s test @ http://127.0.0.1:8091/v1/search/bitmap/prices
  2 threads and 20 connections
  Thread calibration: mean lat.: 1.125ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.276ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.21ms  465.75us   5.53ms   64.78%
    Req/Sec     1.05k   132.95     1.67k    77.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.15ms
 75.000%    1.56ms
 90.000%    1.83ms
 99.000%    2.31ms
 99.900%    2.73ms
 99.990%    4.87ms
 99.999%    5.53ms
100.000%    5.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.103     0.000000            1         1.00
       0.640     0.100000         3991         1.11
       0.774     0.200000         8005         1.25
       0.892     0.300000        12001         1.43
       1.009     0.400000        15965         1.67
       1.151     0.500000        19968         2.00
       1.231     0.550000        21949         2.22
       1.322     0.600000        23940         2.50
       1.412     0.650000        25953         2.86
       1.490     0.700000        27948         3.33
       1.564     0.750000        29956         4.00
       1.601     0.775000        30931         4.44
       1.642     0.800000        31940         5.00
       1.682     0.825000        32922         5.71
       1.725     0.850000        33934         6.67
       1.776     0.875000        34925         8.00
       1.803     0.887500        35436         8.89
       1.833     0.900000        35921        10.00
       1.867     0.912500        36421        11.43
       1.902     0.925000        36908        13.33
       1.948     0.937500        37417        16.00
       1.972     0.943750        37663        17.78
       2.000     0.950000        37910        20.00
       2.032     0.956250        38162        22.86
       2.067     0.962500        38416        26.67
       2.107     0.968750        38661        32.00
       2.129     0.971875        38781        35.56
       2.151     0.975000        38907        40.00
       2.177     0.978125        39034        45.71
       2.207     0.981250        39156        53.33
       2.235     0.984375        39280        64.00
       2.249     0.985938        39343        71.11
       2.271     0.987500        39407        80.00
       2.291     0.989062        39465        91.43
       2.319     0.990625        39529       106.67
       2.347     0.992188        39589       128.00
       2.369     0.992969        39624       142.22
       2.391     0.993750        39655       160.00
       2.421     0.994531        39686       182.86
       2.441     0.995313        39716       213.33
       2.467     0.996094        39746       256.00
       2.481     0.996484        39762       284.44
       2.505     0.996875        39776       320.00
       2.537     0.997266        39792       365.71
       2.567     0.997656        39811       426.67
       2.595     0.998047        39823       512.00
       2.605     0.998242        39831       568.89
       2.631     0.998437        39838       640.00
       2.675     0.998633        39846       731.43
       2.711     0.998828        39854       853.33
       2.741     0.999023        39862      1024.00
       2.759     0.999121        39865      1137.78
       2.779     0.999219        39869      1280.00
       2.863     0.999316        39873      1462.86
       2.969     0.999414        39877      1706.67
       3.053     0.999512        39881      2048.00
       3.101     0.999561        39883      2275.56
       3.283     0.999609        39885      2560.00
       3.331     0.999658        39887      2925.71
       3.455     0.999707        39889      3413.33
       3.665     0.999756        39891      4096.00
       3.703     0.999780        39892      4551.11
       3.717     0.999805        39893      5120.00
       3.765     0.999829        39894      5851.43
       3.769     0.999854        39895      6826.67
       4.867     0.999878        39896      8192.00
       4.867     0.999890        39896      9102.22
       5.011     0.999902        39897     10240.00
       5.011     0.999915        39897     11702.86
       5.023     0.999927        39898     13653.33
       5.023     0.999939        39898     16384.00
       5.023     0.999945        39898     18204.44
       5.287     0.999951        39899     20480.00
       5.287     0.999957        39899     23405.71
       5.287     0.999963        39899     27306.67
       5.287     0.999969        39899     32768.00
       5.287     0.999973        39899     36408.89
       5.535     0.999976        39900     40960.00
       5.535     1.000000        39900          inf
#[Mean    =        1.209, StdDeviation   =        0.466]
#[Max     =        5.532, Total count    =        39900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59963 requests in 30.00s, 11.67MB read
Requests/sec:   1998.65
Transfer/sec:    398.17KB