benchmark/wrk2/map-t1-c1-R100.txt
Running 30s test @ http://127.0.0.1:8091/v1/search/map/prices
  1 threads and 1 connections
  Thread calibration: mean lat.: 2.629ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.67ms  536.58us   6.88ms   79.94%
    Req/Sec   103.77     28.37   222.00     92.99%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.66ms
 75.000%    2.96ms
 90.000%    3.22ms
 99.000%    4.32ms
 99.900%    5.53ms
 99.990%    6.89ms
 99.999%    6.89ms
100.000%    6.89ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.753     0.000000            1         1.00
       2.141     0.100000          203         1.11
       2.287     0.200000          401         1.25
       2.419     0.300000          602         1.43
       2.545     0.400000          802         1.67
       2.663     0.500000         1001         2.00
       2.723     0.550000         1103         2.22
       2.797     0.600000         1201         2.50
       2.849     0.650000         1304         2.86
       2.907     0.700000         1402         3.33
       2.963     0.750000         1500         4.00
       2.993     0.775000         1553         4.44
       3.023     0.800000         1600         5.00
       3.063     0.825000         1650         5.71
       3.105     0.850000         1700         6.67
       3.157     0.875000         1751         8.00
       3.191     0.887500         1775         8.89
       3.225     0.900000         1800        10.00
       3.275     0.912500         1827        11.43
       3.345     0.925000         1851        13.33
       3.405     0.937500         1875        16.00
       3.447     0.943750         1887        17.78
       3.491     0.950000         1900        20.00
       3.521     0.956250         1912        22.86
       3.563     0.962500         1926        26.67
       3.639     0.968750         1938        32.00
       3.677     0.971875         1943        35.56
       3.785     0.975000         1950        40.00
       3.825     0.978125         1956        45.71
       3.967     0.981250         1962        53.33
       4.067     0.984375         1968        64.00
       4.135     0.985938         1971        71.11
       4.191     0.987500         1975        80.00
       4.235     0.989062         1978        91.43
       4.331     0.990625         1982       106.67
       4.399     0.992188         1984       128.00
       4.435     0.992969         1985       142.22
       4.523     0.993750         1987       160.00
       4.623     0.994531         1989       182.86
       4.635     0.995313         1990       213.33
       4.871     0.996094         1992       256.00
       4.871     0.996484         1992       284.44
       4.983     0.996875         1993       320.00
       5.023     0.997266         1994       365.71
       5.107     0.997656         1995       426.67
       5.379     0.998047         1996       512.00
       5.379     0.998242         1996       568.89
       5.379     0.998437         1996       640.00
       5.527     0.998633         1997       731.43
       5.527     0.998828         1997       853.33
       5.979     0.999023         1998      1024.00
       5.979     0.999121         1998      1137.78
       5.979     0.999219         1998      1280.00
       5.979     0.999316         1998      1462.86
       5.979     0.999414         1998      1706.67
       6.887     0.999512         1999      2048.00
       6.887     1.000000         1999          inf
#[Mean    =        2.673, StdDeviation   =        0.537]
#[Max     =        6.884, Total count    =         1999]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3001 requests in 30.00s, 597.86KB read
Requests/sec:    100.02
Transfer/sec:     19.93KB